app/controllers/chatroom_controller.rb

  def index
    @message = Message.new
    @messages = Message.all.includes(:user).order(created_at: :asc)
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3, 4, 5, 6, 7, 8)