app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "fsefsef"], ["user_id", 1], ["created_at", "2026-02-12 03:17:58.728069"], ["updated_at", "2026-02-12 03:17:58.728069"]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save